app/controllers/patient_profiles_controller.rb

  def index
    @patient_profiles = PatientProfile.all
---
SELECT * FROM `patient_profiles`

  def show
    @patient_profile = PatientProfile.find(params[:id])
---
SELECT * FROM `patient_profiles` WHERE (`patient_profiles`.`id` = 0)

  def edit
    @patient_profile = PatientProfile.find(params[:id])
---
SELECT * FROM `patient_profiles` WHERE (`patient_profiles`.`id` = 1000)

  def create
    @patient_profile = PatientProfile.new(params[:patient_profile])

    respond_to do |format|
      if @patient_profile.save
---
INSERT INTO `patient_profiles` (`created_at`, `updated_at`, `gender`, `last_name`, `date_of_birth`, `first_name`) VALUES('2009-06-17 08:41:13', '2009-06-17 08:41:13', NULL, NULL, NULL, NULL)

  def update
    @patient_profile = PatientProfile.find(params[:id])

    respond_to do |format|
      if @patient_profile.update_attributes(params[:patient_profile])
---
SELECT * FROM `patient_profiles` WHERE (`patient_profiles`.`id` = 1004)
UPDATE `patient_profiles` SET `gender` = 'M', `updated_at` = '2009-06-18 17:14:24', `date_of_birth` = '1999-03-10' WHERE `id` = 1010